#include <stdio.h>

int main(int argc, char *argv[])
{
        int a[3][2] = {{1, 6}, {9, 12}, {61, 12}};
        int (*p)[2], i, j;

        p = a;

        printf("%p %p\n", a, a+1);
        printf("%p %p\n", p, p+1);
        //第一个printf()语句打印了a数组和a+1（即第二行的起始位置）的地址值，第二个printf()语句打印了p指针和p+1（即第二行的起始位置）的地址值。

        //printf("%d, %d, %d, %d\n", a[1][1], p[1][1], *(*(a + 1)+1), *(*(p + 1) + 1));
        for (i = 0; i < 3; i++) {
                for (j = 0; j < 2; j++)
                        printf("%d, %d, %d, %d ", a[i][j], p[i][j], *(*(a + i)+j), *(*(p + i) + j));
                puts("");
        }
        //*(*(a + i) + j)：使用指针运算和间接引用，表示通过指针运算访问二维数组a中第i行、第j列的元素值。首先，(a + i)会得到指向第i行的指针，然后*(a + i)会解引用该指针，得到第i行的起始地址。接着，( *(a + i) + j)会将起始地址与j相加，得到第i行、第j列元素的地址，最后*(*(a + i) + j)会通过间接引用获取该地址处的值。


        return 0;
}
